SIGS618/GD32IDE-Project---Learn/firmware/GD32E23x_hal_peripheral/Include/gd32e23x_hal_timer.h
/*!
    \file    gd32e23x_hal_timer.h
    \brief   definitions for the TIMER
    
    \version 2019-03-14, V1.0.0, firmware for GD32E23x
*/

/*
    Copyright (c) 2019, GigaDevice Semiconductor Inc.

    All rights reserved.

    Redistribution and use in source and binary forms, with or without modification, 
are permitted provided that the following conditions are met:

    1. Redistributions of source code must retain the above copyright notice, this 
       list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice, 
       this list of conditions and the following disclaimer in the documentation 
       and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors 
       may be used to endorse or promote products derived from this software without 
       specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" 
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED 
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. 
IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, 
INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT 
NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR 
PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, 
WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) 
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY 
OF SUCH DAMAGE.
*/

#ifndef GD32E23X_HAL_TIMER_H
#define GD32E23X_HAL_TIMER_H

#include "gd32e23x_hal.h"

/* init struct type */
typedef enum {
    HAL_TIMER_BASIC_STRUCT,                                                         /*!< hal_timer_basic_struct */
    HAL_TIMER_CLOCKSOURCE_STRUCT,                                                   /*!< hal_timer_clocksource_struct */
    HAL_TIMER_SLAVEMODE_STRUCT,                                                     /*!< hal_timer_slavemode_struct */
    HAL_TIMER_INPUTCAPTURE_STRUCT,                                                  /*!< hal_timer_inputcapture_struct */
    HAL_TIMER_QUADRATURE_DECODER_STRUCT,                                            /*!< hal_timer_quadrature_decoder_struct */
    HAL_TIMER_SINGLEPULSE_STRUCT,                                                   /*!< hal_timer_singlepulse_struct */
    HAL_TIMER_OUTPUTCOMPARE_STRUCT,                                                 /*!< hal_timer_outputcompare_struct */
    HAL_TIMER_OCPRE_CLEAR_STRUCT,                                                   /*!< hal_timer_ocper_clear_struct */
    HAL_TIMER_HALL_STRUCT,                                                          /*!< hal_timer_hall_struct */
    HAL_TIMER_BREAKCONFIG_STRUCT,                                                   /*!< hal_timer_breakconfig_struct */
    HAL_TIMER_IRQ_STRUCT,                                                           /* TIMER device interrupt callback function pointer structure */
    HAL_TIMER_DEV_STRUCT                                                            /*!< TIMER device information struct */
} hal_timer_struct_type_enum;

/* the service channelx(x=0..3) */
typedef enum {
    TIMER_SERVICE_CHANNEL_NONE = 0x00,                                              /*!< none channel service */
    TIMER_SERVICE_CHANNEL_0,                                                        /*!< service chanenl0 */
    TIMER_SERVICE_CHANNEL_1,                                                        /*!< service chanenl1 */
    TIMER_SERVICE_CHANNEL_2,                                                        /*!< service chanenl2 */
    TIMER_SERVICE_CHANNEL_3                                                         /*!< service chanenl3 */
} hal_timer_service_channel_enum;

/* master mode control */
typedef enum {
    TIMRE_TRGO_SRC_RESET  = TIMER_TRI_OUT_SRC_RESET,                                /*!< the selection of TRGO signal:RESET */                   
    TIMRE_TRGO_SRC_ENABLE = TIMER_TRI_OUT_SRC_ENABLE,                               /*!< the selection of TRGO signal:ENABLE */             
    TIMRE_TRGO_SRC_UPDATE = TIMER_TRI_OUT_SRC_UPDATE,                               /*!< the selection of TRGO signal:UPDATE */
    TIMRE_TRGO_SRC_CH0    = TIMER_TRI_OUT_SRC_CH0,                                  /*!< the selection of TRGO signal: channel0 capture/compare pulse */
    TIMRE_TRGO_SRC_O0CPRE = TIMER_TRI_OUT_SRC_O0CPRE,                               /*!< the selection of TRGO signal:O0CPRE */
    TIMRE_TRGO_SRC_O1CPRE = TIMER_TRI_OUT_SRC_O1CPRE,                               /*!< the selection of TRGO signal:O1CPRE */
    TIMRE_TRGO_SRC_O2CPRE = TIMER_TRI_OUT_SRC_O2CPRE,                               /*!< the selection of TRGO signal:O2CPRE */
    TIMRE_TRGO_SRC_O3CPRE = TIMER_TRI_OUT_SRC_O3CPRE                                /*!< the selection of TRGO signal:O3CPRE */
} hal_timer_trgo_selection_enum;

/* slave mode control */
typedef enum{
    TIMER_SLAVE_DISABLE_MODE = TIMER_SLAVE_MODE_DISABLE,                            /*!< slave mode disable */
    TIMER_SLAVE_MODE_RESTART_MODE = TIMER_SLAVE_MODE_RESTART,                       /*!< restart mode */
    TIMER_SLAVE_MODE_PAUSE_MODE = TIMER_SLAVE_MODE_PAUSE,                           /*!< pause mode */
    TIMER_SLAVE_MODE_EVENT_MODE = TIMER_SLAVE_MODE_EVENT,                           /*!< event mode */
    TIMER_SLAVE_MODE_EXTERNAL0_MODE = TIMER_SLAVE_MODE_EXTERNAL0                    /*!< external clock mode 0 */
} hal_timer_slave_mode_enum;

/*!< trigger input source */
typedef enum{
    TIMER_TRIGGER_SOURCE_ITI0 = TIMER_SMCFG_TRGSEL_ITI0,                            /*!< trigger input source selection:ITI0 */
    TIMER_TRIGGER_SOURCE_ITI1 = TIMER_SMCFG_TRGSEL_ITI1,                            /*!< trigger input source selection:ITI1 */
    TIMER_TRIGGER_SOURCE_ITI2 = TIMER_SMCFG_TRGSEL_ITI2,                            /*!< trigger input source selection:ITI2 */
    TIMER_TRIGGER_SOURCE_ITI3 = TIMER_SMCFG_TRGSEL_ITI3,                            /*!< trigger input source selection:ITI3 */
    TIMER_TRIGGER_SOURCE_CI0FE0 = TIMER_SMCFG_TRGSEL_CI0FE0,                        /*!< trigger input source selection:CI0FE0 */
    TIMER_TRIGGER_SOURCE_CI1FE1 = TIMER_SMCFG_TRGSEL_CI1FE1,                        /*!< trigger input source selection:CI1FE1 */
    TIMER_TRIGGER_SOURCE_CI0FED = TIMER_SMCFG_TRGSEL_CI0F_ED,                       /*!< trigger input source selection:CI0FED */
    TIMER_TRIGGER_SOURCE_ETIFP = (uint32_t)0x00000001,                              /*!< trigger input source selection:ETIFP */
    TIMER_TRIGGER_SOURCE_DISABLE = (uint32_t)0x00000002                             /*!< trigger input source selection:none */
} hal_timer_input_trigger_source_enum;

