SIGS618/GD32IDE-Project---Learn/firmware/GD32E23x_hal_peripheral/Include/gd32e23x_hal_timer.h
/*!< clock input and trigger input source polarity */
typedef enum{
    TIMER_CLOCK_TRIGGER_POLARITY_ETI_RISING = TIMER_ETP_RISING,                     /*!< clock input source is ETI, active high or rising edge active */
    TIMER_CLOCK_TRIGGER_POLARITY_ETI_FALLING = TIMER_ETP_FALLING,                   /*!< clock input source is ETI, active low or falling edge active */
    TIMER_CLOCK_TRIGGER_POLARITY_RISING = (uint32_t)TIMER_IC_POLARITY_RISING,       /*!< clock input source is CIx(x=0,1), rising edge active */
    TIMER_CLOCK_TRIGGER_POLARITY_FALLING = (uint32_t)TIMER_IC_POLARITY_FALLING,     /*!< clock input source is CIx(x=0,1), falling edge active */
    TIMER_CLOCK_TRIGGER_POLARITY_BOTH_EDGE = (uint32_t)TIMER_IC_POLARITY_BOTH_EDGE  /*!< clock input source is CI0F_ED, both rising and falling edge active */
} hal_timer_clock_trigger_polarity_enum;

/* clock input source */
typedef enum{
    TIMER_CLOCK_SOURCE_CK_TIMER = (uint32_t)0x00000001,                             /*!< clock input source selection:Internal clock CK_TIMER */
    TIMER_CLOCK_SOURCE_ITI0 = TIMER_SMCFG_TRGSEL_ITI0,                              /*!< clock input source selection:ITI0 */
    TIMER_CLOCK_SOURCE_ITI1 = TIMER_SMCFG_TRGSEL_ITI1,                              /*!< clock input source selection:ITI1 */
    TIMER_CLOCK_SOURCE_ITI2 = TIMER_SMCFG_TRGSEL_ITI2,                              /*!< clock input source selection:ITI2 */
    TIMER_CLOCK_SOURCE_ITI3 = TIMER_SMCFG_TRGSEL_ITI3,                              /*!< clock input source selection:ITI3 */
    TIMER_CLOCK_SOURCE_CI0FE0 = TIMER_SMCFG_TRGSEL_CI0FE0,                          /*!< clock input source selection:CI0FE0 */
    TIMER_CLOCK_SOURCE_CI1FE1 = TIMER_SMCFG_TRGSEL_CI1FE1,                          /*!< clock input source selection:CI1FE1 */
    TIMER_CLOCK_SOURCE_CI0FED = TIMER_SMCFG_TRGSEL_CI0F_ED,                         /*!< clock input source selection:CI0FED */
    TIMER_CLOCK_SOURCE_ETIMODE0 = TIMER_SMCFG_TRGSEL_ETIFP,                         /*!< clock input source selection:ETI in external clock mode0 */
    TIMER_CLOCK_SOURCE_ETIMODE1 = TIMER_SMCFG_SMC1                                  /*!< clock input source selection:ETI in external clock mode1 */
} hal_timer_clock_source_enum;

/* TIMER software event generation source */
typedef enum{
    TIMER_SOFTWARE_EVENT_UPDATE = TIMER_EVENT_SRC_UPG,                              /*!< update event generation */
    TIMER_SOFTWARE_EVENT_CH0 = TIMER_EVENT_SRC_CH0G,                                /*!< channel 0 capture or compare event generation */
    TIMER_SOFTWARE_EVENT_CH1 = TIMER_EVENT_SRC_CH1G,                                /*!< channel 1 capture or compare event generation */
    TIMER_SOFTWARE_EVENT_CH2 = TIMER_EVENT_SRC_CH2G,                                /*!< channel 2 capture or compare event generation */
    TIMER_SOFTWARE_EVENT_CH3 = TIMER_EVENT_SRC_CH3G,                                /*!< channel 3 capture or compare event generation */
    TIMER_SOFTWARE_EVENT_CMT = TIMER_EVENT_SRC_CMTG,                                /*!< channel commutation event generation */
    TIMER_SOFTWARE_EVENT_TRG = TIMER_EVENT_SRC_TRGG,                                /*!< trigger event generation */
    TIMER_SOFTWARE_EVENT_BRK = TIMER_EVENT_SRC_BRKG                                 /*!< break event generation */
}hal_timer_software_event_enum;

/* TIMER channel compare output control */
typedef enum{
    TIMER_OUTPUT_TIMING_MODE = TIMER_OC_MODE_TIMING,                                /*!< timing mode */
    TIMER_OUTPUT_ACTIVE_MODE = TIMER_OC_MODE_ACTIVE,                                /*!< active mode */
    TIMER_OUTPUT_INACTIVE_MODE = TIMER_OC_MODE_INACTIVE,                            /*!< inactive mode */
    TIMER_OUTPUT_TOGGLE_MODE = TIMER_OC_MODE_TOGGLE,                                /*!< toggle mode */
    TIMER_OUTPUT_LOW_MODE = TIMER_OC_MODE_LOW,                                      /*!< force low mode */
    TIMER_OUTPUT_HIGH_MODE = TIMER_OC_MODE_HIGH,                                    /*!< force high mode */
    TIMER_OUTPUT_PWM0_MODE = TIMER_OC_MODE_PWM0,                                    /*!< PWM0 mode */
    TIMER_OUTPUT_PWM1_MODE = TIMER_OC_MODE_PWM1                                     /*!< PWM1 mode*/
} hal_timer_output_compare_enum;

/* DMA transfer access start address */
typedef enum{
    TIMER_DMA_START_ADDRESS_CTL0 = TIMER_DMACFG_DMATA_CTL0,                         /*!< DMA transfer address is TIMER_CTL0 */
    TIMER_DMA_START_ADDRESS_CTL1 = TIMER_DMACFG_DMATA_CTL1,                         /*!< DMA transfer address is TIMER_CTL1 */
    TIMER_DMA_START_ADDRESS_SMCFG = TIMER_DMACFG_DMATA_SMCFG,                       /*!< DMA transfer address is TIMER_SMCFG */
    TIMER_DMA_START_ADDRESS_DMAINTEN = TIMER_DMACFG_DMATA_DMAINTEN,                 /*!< DMA transfer address is TIMER_DMAINTEN */
    TIMER_DMA_START_ADDRESS_INTF = TIMER_DMACFG_DMATA_INTF,                         /*!< DMA transfer address is TIMER_INTF */
    TIMER_DMA_START_ADDRESS_SWEVG = TIMER_DMACFG_DMATA_SWEVG,                       /*!< DMA transfer address is TIMER_SWEVG */
    TIMER_DMA_START_ADDRESS_CHCTL0 = TIMER_DMACFG_DMATA_CHCTL0,                     /*!< DMA transfer address is TIMER_CHCTL0 */
    TIMER_DMA_START_ADDRESS_CHCTL1 = TIMER_DMACFG_DMATA_CHCTL1,                     /*!< DMA transfer address is TIMER_CHCTL1 */
    TIMER_DMA_START_ADDRESS_CHCTL2 = TIMER_DMACFG_DMATA_CHCTL2,                     /*!< DMA transfer address is TIMER_CHCTL2 */
    TIMER_DMA_START_ADDRESS_CNT = TIMER_DMACFG_DMATA_CNT,                           /*!< DMA transfer address is TIMER_CNT */
    TIMER_DMA_START_ADDRESS_PSC = TIMER_DMACFG_DMATA_PSC,                           /*!< DMA transfer address is TIMER_PSC */
    TIMER_DMA_START_ADDRESS_CAR = TIMER_DMACFG_DMATA_CAR,                           /*!< DMA transfer address is TIMER_CAR */
    TIMER_DMA_START_ADDRESS_CREP = TIMER_DMACFG_DMATA_CREP,                         /*!< DMA transfer address is TIMER_CREP */
    TIMER_DMA_START_ADDRESS_CH0CV = TIMER_DMACFG_DMATA_CH0CV,                       /*!< DMA transfer address is TIMER_CH0CV */
    TIMER_DMA_START_ADDRESS_CH1CV = TIMER_DMACFG_DMATA_CH1CV,                       /*!< DMA transfer address is TIMER_CH1CV */
    TIMER_DMA_START_ADDRESS_CH2CV = TIMER_DMACFG_DMATA_CH2CV,                       /*!< DMA transfer address is TIMER_CH2CV */
    TIMER_DMA_START_ADDRESS_CH3CV = TIMER_DMACFG_DMATA_CH3CV,                       /*!< DMA transfer address is TIMER_CH3CV */
    TIMER_DMA_START_ADDRESS_CCHP = TIMER_DMACFG_DMATA_CCHP,                         /*!< DMA transfer address is TIMER_CCHP */
    TIMER_DMA_START_ADDRESS_DMACFG = TIMER_DMACFG_DMATA_DMACFG                      /*!< DMA transfer address is TIMER_DMACFG */
} hal_timer_dma_start_address_enum;

/* TIMER DMA mode request source */
typedef enum{
    TIMER_DMA_REQUEST_SOURCE_UPDATE = TIMER_DMA_UPD,                                /*!< update DMA enable */
    TIMER_DMA_REQUEST_SOURCE_CH0 = TIMER_DMA_CH0D,                                  /*!< channel 0 DMA enable */
    TIMER_DMA_REQUEST_SOURCE_CH1 = TIMER_DMA_CH1D,                                  /*!< channel 1 DMA enable */
    TIMER_DMA_REQUEST_SOURCE_CH2 = TIMER_DMA_CH2D,                                  /*!< channel 2 DMA enable */
    TIMER_DMA_REQUEST_SOURCE_CH3 = TIMER_DMA_CH3D,                                  /*!< channel 3 DMA enable */
    TIMER_DMA_REQUEST_SOURCE_CMT = TIMER_DMA_CMTD,                                  /*!< commutation DMA request enable */
    TIMER_DMA_REQUEST_SOURCE_TRG = TIMER_DMA_TRGD                                   /*!< trigger DMA enable */
} hal_timer_dma_request_source_enum;

/* TIMER device interrupt callback function pointer structure */
typedef struct {
    hal_irq_handle_cb dmaerror_usercb;                      /*!< DMA channel error interrupt call */
    hal_irq_handle_cb dmatc_update_usercb;                  /*!< DMA transmission complete interrupt(TC) user callback for update dma request */
    hal_irq_handle_cb dmatc_chx_cmppwm_usercb;              /*!< DMA transmission complete interrupt(TC) user callback for channelx compare output and pwm output dma request */
    hal_irq_handle_cb dmatc_chx_capture_usercb;             /*!< DMA transmission complete interrupt(TC) user callback for channelx input capture dma request */
    hal_irq_handle_cb dmatc_commutation_usercb;             /*!< DMA transmission complete interrupt(TC) user callback for commutation DMA request */
    hal_irq_handle_cb dmatc_trigger_usercb;                 /*!< DMA transmission complete interrupt(TC) user callback for trigger DMA request */
    hal_irq_handle_cb update_usercb;                        /*!< TIMER update interrupt call */
    hal_irq_handle_cb channelx_compare_usercb;              /*!< channel interrupt for compare output */
    hal_irq_handle_cb channelx_pwm_usercb;                  /*!< channel interrupt for PWM output */
    hal_irq_handle_cb channelx_capture_usercb;              /*!< channel interrupt for input capture */
    hal_irq_handle_cb commutation_usercb;                   /*!< TIMER commutation interrupt call */
    hal_irq_handle_cb trigger_usercb;                       /*!< TIMER trigger interrupt call */
    hal_irq_handle_cb break_usercb;                         /*!< TIMER break interrupt call */
} hal_timer_dev_irq_struct;

