SIGS618/GD32IDE-Project---Learn/firmware/GD32E23x_hal_peripheral/Include/gd32e23x_hal_timer.h
/* TIMER device infomation struct*/
typedef struct{
    uint32_t periph;                                        /*!< TIMERx(x=0,2,5,13..16) */
    hal_timer_service_channel_enum service_channel;         /*!< the service channelx */
    hal_dma_dev_struct *hdma[7];                            /*!< DMA dev infomation index */
    hal_timer_dev_irq_struct timer_irq;                     /*!< TIMER device interrupt callback function pointer structure */
}hal_timer_dev_struct;

/*TIMER user call back function */
typedef void (*hal_timer_user_cb)(hal_timer_dev_struct *timer_dev);

/* TIMER interrupt user callback function pointer structure */
typedef struct {
    hal_timer_user_cb dmaerror_usercb;                      /*!< DMA channel error interrupt call */
    hal_timer_user_cb dmatc_update_usercb;                  /*!< DMA transmission complete interrupt(TC) user callback for update dma request */
    hal_timer_user_cb dmatc_chx_cmppwm_usercb;              /*!< DMA transmission complete interrupt(TC) user callback for channelx compare output and pwm output dma request */
    hal_timer_user_cb dmatc_chx_capture_usercb;             /*!< DMA transmission complete interrupt(TC) user callback for channelx input capture dma request */
    hal_timer_user_cb dmatc_commutation_usercb;             /*!< DMA transmission complete interrupt(TC) user callback for commutation DMA request */
    hal_timer_user_cb dmatc_trigger_usercb;                 /*!< DMA transmission complete interrupt(TC) user callback for trigger DMA request */
    hal_timer_user_cb update_usercb;                        /*!< TIMER update interrupt call */
    hal_timer_user_cb channelx_compare_usercb;              /*!< channel interrupt for compare output */
    hal_timer_user_cb channelx_pwm_usercb;                  /*!< channel interrupt for PWM output */
    hal_timer_user_cb channelx_capture_usercb;              /*!< channel interrupt for input capture */
    hal_timer_user_cb commutation_usercb;                   /*!< TIMER commutation interrupt call */
    hal_timer_user_cb trigger_usercb;                       /*!< TIMER trigger interrupt call */
    hal_timer_user_cb break_usercb;                         /*!< TIMER break interrupt call */
} hal_timer_irq_struct;

/* TIMER basic config struct */
typedef struct{
    uint16_t prescaler;                                     /*!< prescaler value */
    uint16_t alignedmode;                                   /*!< aligned mode */
    uint16_t counterdirection;                              /*!< counter direction */
    uint32_t period;                                        /*!< period value */
    uint16_t clockdivision;                                 /*!< clock division value */
    uint8_t  repetitioncounter;                             /*!< the counter repetition value */
    uint32_t autoreload_shadow;                             /*!< auto-reload shadow enable or disable, TIMERx_CTL0:bit7(ARSE) */
    hal_timer_trgo_selection_enum trgo_selection;           /*!< master mode control, TIMERx_CTL1:bit4~6(MMC) */
    uint32_t master_slave_mode;                             /*!< master-slave mode, TIMERx_SMCFG:bit7(MSM) */
}hal_timer_basic_struct;

/* TIMER clock source config struct */
typedef struct{
    hal_timer_clock_source_enum clock_source;               /*!< select clock input source */
    hal_timer_clock_trigger_polarity_enum clock_polarity;   /*!< clock input source polarity */
    uint32_t clock_prescaler;                               /*!< clock input source prescaler */
    uint32_t clock_filter;                                  /*!< clock input source filter, 0x00~0x0F */
}hal_timer_clocksource_struct;

/* TIMER slave mode config struct */
typedef struct{
    hal_timer_slave_mode_enum slavemode;                    /*!< slave mode control */
    hal_timer_input_trigger_source_enum trigger_selection;  /*!< trigger selection */
    hal_timer_clock_trigger_polarity_enum trigger_polarity; /*!< trigger input source polarity */
    uint32_t trigger_prescaler;                             /*!< trigger input source prescaler */
    uint32_t trigger_filter;                                /*!< trigger input source filter, 0x00~0x0F */
}hal_timer_slavemode_struct;

/* TIMER quadrature decoder mode struct */
typedef struct{
    uint32_t decodemode;                                    /*!< quadrature decoder mode */
    uint32_t ci0_selection;                                 /*!< channel0 I/O mode selection */
    uint32_t ci0_polarity;                                  /*!< channel0 input capture polarity */
    uint32_t ci0_filter;                                    /*!< channel0 input capture filter control */
    uint32_t ci0_prescaler;                                 /*!< channel0 input capture prescaler */
    uint32_t ci1_selection;                                 /*!< channel1 I/O mode selection */
    uint32_t ci1_polarity;                                  /*!< channel1 input capture polarity */
    uint32_t ci1_filter;                                    /*!< channel1 input capture filter control */
    uint32_t ci1_prescaler;                                 /*!< channel1 input capture prescaler */
}hal_timer_quadrature_decoder_struct;

/* TIMER output compare mode struct */
typedef struct{
    hal_timer_output_compare_enum output_mode;              /*!< channel compare output control */
    uint32_t output_pulse;                                  /*!< channel capture or compare value */
    uint32_t output_fastmode;                               /*!< channel output compare fast */
    uint16_t output_polarity;                               /*!< channel output polarity */
    uint16_t outputn_polarity;                              /*!< channel complementary output polarity */
    uint16_t output_idlestate;                              /*!< idle state of channel output */
    uint16_t outputn_idlestate;                             /*!< idle state of channel complementary output */
}hal_timer_outputcompare_struct;

/* TIMER single pulse mode struct */
typedef struct{
    hal_timer_output_compare_enum sp_ocmode;                /*!< channel compare output control */
    uint32_t sp_pulse;                                      /*!< channel capture or compare value */
    uint16_t sp_ocpolarity;                                 /*!< channel output polarity */
    uint16_t sp_ocnpolarity;                                /*!< channel complementary output polarity */
    uint16_t sp_ocidlestate;                                /*!< idle state of channel output */
    uint16_t sp_ocnidlestate;                               /*!< idle state of channel complementary output */
    uint32_t sp_ci_selection;                               /*!< channel1 I/O mode selection */
    uint32_t sp_ci_polarity;                                /*!< channel1 input capture polarity */
    uint32_t sp_ci_filter;                                  /*!< channel1 input capture filter control */
}hal_timer_singlepulse_struct;

/* TIMER output compare clear struct */
typedef struct{
    uint32_t ocpre_clear_source;                            /*!< OCPRE clear source selection */
    uint32_t ocpre_clear_state;                             /*!< ENABLE or DISABLE */
    uint32_t trigger_polarity;                              /*!< external trigger polarity */
    uint32_t trigger_prescaler;                             /*!< external trigger prescaler */
    uint32_t trigger_filter;                                /*!< external trigger filter control */
}hal_timer_ocpre_clear_struct;

/* TIMER HALL sensor interface function */
typedef struct{
    uint32_t cmt_delay;                                     /*!< commutation delay(channel 1 value) */
    uint32_t hall_polarity;                                 /*!< channel0 input capture polarity */
    uint32_t hall_filter;                                   /*!< channel0 input capture filter control */
    uint32_t hall_prescaler;                                /*!< channel0 input capture prescaler */
}hal_timer_hall_struct;

/* TIMER channel input capture parameter struct */
typedef timer_ic_parameter_struct hal_timer_inputcapture_struct;

/* TIMER break parameter struct */
typedef timer_break_parameter_struct hal_timer_breakconfig_struct;

/* registers definitions */
#define TIMER_CTL0_ADDRESS(timerx)               (uint32_t)((timerx) + 0x00U)       /*!< TIMER control register 0 */
#define TIMER_CTL1_ADDRESS(timerx)               (uint32_t)((timerx) + 0x04U)      /*!< TIMER control register 1 */
#define TIMER_SMCFG_ADDRESS(timerx)              (uint32_t)((timerx) + 0x08U)      /*!< TIMER slave mode configuration register */
#define TIMER_DMAINTEN_ADDRESS(timerx)           (uint32_t)((timerx) + 0x0CU)      /*!< TIMER DMA and interrupt enable register */
#define TIMER_INTF_ADDRESS(timerx)               (uint32_t)((timerx) + 0x10U)      /*!< TIMER interrupt flag register */
#define TIMER_SWEVG_ADDRESS(timerx)              (uint32_t)((timerx) + 0x14U)      /*!< TIMER software event generation register */
#define TIMER_CHCTL0_ADDRESS(timerx)             (uint32_t)((timerx) + 0x18U)      /*!< TIMER channel control register 0 */
#define TIMER_CHCTL1_ADDRESS(timerx)             (uint32_t)((timerx) + 0x1CU)      /*!< TIMER channel control register 1 */
#define TIMER_CHCTL2_ADDRESS(timerx)             (uint32_t)((timerx) + 0x20U)      /*!< TIMER channel control register 2 */
#define TIMER_CNT_ADDRESS(timerx)                (uint32_t)((timerx) + 0x24U)      /*!< TIMER counter register */
#define TIMER_PSC_ADDRESS(timerx)                (uint32_t)((timerx) + 0x28U)      /*!< TIMER prescaler register */
#define TIMER_CAR_ADDRESS(timerx)                (uint32_t)((timerx) + 0x2CU)      /*!< TIMER counter auto reload register */
#define TIMER_CREP_ADDRESS(timerx)               (uint32_t)((timerx) + 0x30U)      /*!< TIMER counter repetition register */
#define TIMER_CH0CV_ADDRESS(timerx)              (uint32_t)((timerx) + 0x34U)      /*!< TIMER channel 0 capture/compare value register */
#define TIMER_CH1CV_ADDRESS(timerx)              (uint32_t)((timerx) + 0x38U)      /*!< TIMER channel 1 capture/compare value register */
#define TIMER_CH2CV_ADDRESS(timerx)              (uint32_t)((timerx) + 0x3CU)      /*!< TIMER channel 2 capture/compare value register */
#define TIMER_CH3CV_ADDRESS(timerx)              (uint32_t)((timerx) + 0x40U)      /*!< TIMER channel 3 capture/compare value register */
#define TIMER_CCHP_ADDRESS(timerx)               (uint32_t)((timerx) + 0x44U)      /*!< TIMER complementary channel protection register */
#define TIMER_DMACFG_ADDRESS(timerx)             (uint32_t)((timerx) + 0x48U)      /*!< TIMER DMA configuration register */
#define TIMER_DMATB_ADDRESS(timerx)              (uint32_t)((timerx) + 0x4CU)      /*!< TIMER DMA transfer buffer register */
#define TIMER_IRMP_ADDRESS(timerx)               (uint32_t)((timerx) + 0x50U)      /*!< TIMER channel input remap register */
#define TIMER_CFG_ADDRESS(timerx)                (uint32_t)((timerx) + 0xFCU)      /*!< TIMER configuration register */

