SIGS618/GD32IDE-Project---Learn/firmware/GD32E23x_hal_peripheral/Include/gd32e23x_hal_timer.h
/* DMA dev infomation index */
#define TIM_DMA_ID_UP                       ((uint8_t) 0x0U)                        /*!< specify update DMA */
#define TIM_DMA_ID_CH0                      ((uint8_t) 0x1U)                        /*!< specify channel 0 DMA */
#define TIM_DMA_ID_CH1                      ((uint8_t) 0x2U)                        /*!< specify channel 1 DMA */
#define TIM_DMA_ID_CH2                      ((uint8_t) 0x3U)                        /*!< specify channel 2 DMA */
#define TIM_DMA_ID_CH3                      ((uint8_t) 0x4U)                        /*!< specify channel 3 DMA */
#define TIM_DMA_ID_CMT                      ((uint8_t) 0x5U)                        /*!< specify commutation DMA request */
#define TIM_DMA_ID_TRG                      ((uint8_t) 0x6U)                        /*!< specify trigger DMA */

/* auto-reload shadow enable or disable,TIMERx_CTL0:bit7(ARSE) */
#define AUTO_RELOAD_SHADOW_ENABLE           BIT(7)
#define AUTO_RELOAD_SHADOW_DISABLE          (uint32_t)(0x00000000)

/* clock input source prescaler */
#define TIMER_CLOCK_PRESCALER_DIV1          TIMER_EXT_TRI_PSC_OFF                   /*!< clock input source no divided for ETI */
#define TIMER_CLOCK_PRESCALER_DIV2          TIMER_EXT_TRI_PSC_DIV2                  /*!< clock input source divided by 2 for ETI */
#define TIMER_CLOCK_PRESCALER_DIV4          TIMER_EXT_TRI_PSC_DIV4                  /*!< clock input source divided by 4 for ETI */
#define TIMER_CLOCK_PRESCALER_DIV8          TIMER_EXT_TRI_PSC_DIV8                  /*!< clock input source divided by 8 for ETI */

/* channel 0 trigger input selection */
#define TIMER_CI0_CH0IN                     TIMER_HALLINTERFACE_DISABLE             /*!< The TIMERx_CH0 pin input is selected as channel 0 trigger input. */
#define TIMER_CI0_XOR_CH012                 TIMER_HALLINTERFACE_ENABLE              /*!< The result of combinational XOR of TIMERx_CH0, CH1 and CH2 pins is selected as channel 0 trigger input */

/*  */
#define TIMER_QUADRATURE_DECODER_MODE0      TIMER_ENCODER_MODE0                     /*!< quadrature decoder mode 0 */
#define TIMER_QUADRATURE_DECODER_MODE1      TIMER_ENCODER_MODE1                     /*!< quadrature decoder mode 1 */
#define TIMER_QUADRATURE_DECODER_MODE2      TIMER_ENCODER_MODE2                     /*!< quadrature decoder mode 2 */

/* channel mask */
#define TIMER_CHX_EN_MASK                   ((uint32_t)(TIMER_CHCTL2_CH0EN|\
                                            TIMER_CHCTL2_CH1EN|TIMER_CHCTL2_CH2EN|\
                                            TIMER_CHCTL2_CH3EN))                    /*!< channel enable mask */
#define TIMER_CHNX_EN_MASK                  ((uint32_t)(TIMER_CHCTL2_CH0NEN|\
                                            TIMER_CHCTL2_CH1NEN|\
                                            TIMER_CHCTL2_CH2NEN))                   /*!< complementary channel enable mask */

/* function declarations */
/* initialize the TIMER structure with the default values */
int32_t hal_timer_struct_init(hal_timer_struct_type_enum hal_struct_type, void *p_struct);
/* deinitialize TIMER */
int32_t hal_timer_deinit(hal_timer_dev_struct *timer_dev);

/*  timebase settings*/
/* initialize TIMER timebase  */
int32_t hal_timer_basic_init(hal_timer_dev_struct *timer_dev, uint32_t timer_periph, hal_timer_basic_struct *timer_basic);
/* TIMER counter enable */
int32_t hal_timer_start_counter(hal_timer_dev_struct *timer_dev);
/* TIMER counter disable */
int32_t hal_timer_stop_counter(hal_timer_dev_struct *timer_dev);
/* TIMER counter and update interrupt enable */
int32_t hal_timer_start_counter_interrupt(hal_timer_dev_struct *timer_dev);
/* TIMER counter and update interrupt stop */
int32_t hal_timer_stop_counter_interrupt(hal_timer_dev_struct *timer_dev);
/* TIMER counter and update DMA request enable */
int32_t hal_timer_start_counter_dma(hal_timer_dev_struct *timer_dev, uint32_t *buffer, uint16_t blength);
/* TIMER counter and update DMA request disable */
int32_t hal_timer_stop_counter_dma(hal_timer_dev_struct *timer_dev);

/* slave mode settings */
/* TIMER slave mode congfig */
int32_t hal_timer_slave_mode_config(hal_timer_dev_struct *timer_dev, hal_timer_slavemode_struct *timer_slavemode);
/* TIMER slave mode congfig and interrupt congfig */
int32_t hal_timer_slave_mode_interrupt_config(hal_timer_dev_struct *timer_dev, hal_timer_slavemode_struct *timer_slavemode);

/* timer clock source config */
int32_t hal_timer_clock_source_config(hal_timer_dev_struct *timer_dev, hal_timer_clocksource_struct *timer_clock);
/* TIMER break config */
int32_t hal_timer_break_config(hal_timer_dev_struct *timer_dev, hal_timer_breakconfig_struct *break_cofig);
/* timer OxCPRE signal clear config  */
int32_t hal_timer_ocpre_clear_config(hal_timer_dev_struct *timer_dev,hal_timer_ocpre_clear_struct *oc_clear, uint32_t channel);
/* TIMER CI0 trigger input selection*/
int32_t hal_timer_ci0_input_selection(hal_timer_dev_struct *timer_dev,uint32_t ci0_select);
/* TIMERx remap */
int32_t hal_timer_remap_config(hal_timer_dev_struct *timer_dev,uint32_t remap);
/* TIMER generate a software event */
int32_t hal_timer_generate_event(hal_timer_dev_struct *timer_dev, hal_timer_software_event_enum event_src);

/* compare output settings */
/* initialize TIMER output compare mode */
int32_t hal_timer_outputcompare_init(hal_timer_dev_struct *timer_dev, uint16_t channel, hal_timer_outputcompare_struct *timer_compare);
/* start TIMER output compare mode */
int32_t hal_timer_start_outputcompare(hal_timer_dev_struct *timer_dev, uint16_t channel);
/* stop TIMER output compare mode */
int32_t hal_timer_stop_outputcompare(hal_timer_dev_struct *timer_dev, uint16_t channel);
/* start TIMER output compare mode and channel interrupt */
int32_t hal_timer_start_outputcompare_interrupt(hal_timer_dev_struct *timer_dev, uint16_t channel);
/* stop TIMER output compare mode and channel interrupt */
int32_t hal_timer_stop_outputcompare_interrupt(hal_timer_dev_struct *timer_dev, uint16_t channel);
/* start TIMER output compare mode and channel dma request */
int32_t hal_timer_start_outputcompare_dma(hal_timer_dev_struct *timer_dev, uint16_t channel, uint32_t *buffer, uint16_t blength);
/* stop TIMER output compare mode and channel dma request */
int32_t hal_timer_stop_outputcompare_dma(hal_timer_dev_struct *timer_dev, uint16_t channel);
/* start TIMER complementary output compare mode */
int32_t hal_timer_start_outputcompare_negtive(hal_timer_dev_struct *timer_dev, uint16_t channel);
/* stop TIMER complementary output compare mode */
int32_t hal_timer_stop_outputcompare_negtive(hal_timer_dev_struct *timer_dev, uint16_t channel);
/* start TIMER complementary output compare mode and channel interrupt */
int32_t hal_timer_start_outputcompare_negtive_interrupt(hal_timer_dev_struct *timer_dev, uint16_t channel);
/* stop TIMER complementary output compare mode and channel interrupt */
int32_t hal_timer_stop_outputcompare_negtive_interrupt(hal_timer_dev_struct *timer_dev, uint16_t channel);
/* start TIMER complementary output compare mode and channel dma request */
int32_t hal_timer_start_outputcompare_negtive_dma(hal_timer_dev_struct *timer_dev, uint16_t channel, uint32_t *buffer, uint16_t blength);
/* stop TIMER complementary output compare mode and channel dma request */
int32_t hal_timer_stop_outputcompare_negtive_dma(hal_timer_dev_struct *timer_dev, uint16_t channel);

/* pwm output settings */
/* initialize TIMER pwm mode */
int32_t hal_timer_pwm_init(hal_timer_dev_struct *timer_dev, uint16_t channel, hal_timer_outputcompare_struct *timer_compare);
/* start TIMER pwm mode */
int32_t hal_timer_start_pwm(hal_timer_dev_struct *timer_dev, uint16_t channel);
/* stop TIMER pwm mode */
int32_t hal_timer_stop_pwm(hal_timer_dev_struct *timer_dev, uint16_t channel);
/* start TIMER pwm mode and channel interrupt */
int32_t hal_timer_start_pwm_interrupt(hal_timer_dev_struct *timer_dev, uint16_t channel);
/* stop TIMER pwm mode and channel interrupt */
int32_t hal_timer_stop_pwm_interrupt(hal_timer_dev_struct *timer_dev, uint16_t channel);
/* start TIMER pwm mode and channel dma request */
int32_t hal_timer_start_pwm_dma(hal_timer_dev_struct *timer_dev, uint16_t channel, uint32_t *buffer, uint16_t blength);
/* stop TIMER pwm mode and channel dma request */
int32_t hal_timer_stop_pwm_dma(hal_timer_dev_struct *timer_dev, uint16_t channel);
/* start TIMER complementary pwm mode */
int32_t hal_timer_start_pwm_negtive(hal_timer_dev_struct *timer_dev, uint16_t channel);
/* stop TIMER complementary pwm mode */
int32_t hal_timer_stop_pwm_negtive(hal_timer_dev_struct *timer_dev, uint16_t channel);
/* start TIMER complementary pwm mode and channel interrupt */
int32_t hal_timer_start_pwm_negtive_interrupt(hal_timer_dev_struct *timer_dev, uint16_t channel);
/* stop TIMER complementary pwm mode and channel interrupt */
int32_t hal_timer_stop_pwm_negtive_interrupt(hal_timer_dev_struct *timer_dev, uint16_t channel);
/* start TIMER complementary pwm mode and channel dma request */
int32_t hal_timer_start_pwm_negtive_dma(hal_timer_dev_struct *timer_dev, uint16_t channel, uint32_t *buffer, uint16_t blength);
/* stop TIMER complementary pwm mode and channel dma request */
int32_t hal_timer_stop_pwm_negtive_dma(hal_timer_dev_struct *timer_dev, uint16_t channel);

/* input capture settings*/
/* initialize TIMER input capture mode */
int32_t hal_timer_inputcapture_init(hal_timer_dev_struct *timer_dev, uint16_t channel, hal_timer_inputcapture_struct *timer_capture);
/* start TIMER input capture mode */
int32_t hal_timer_start_inputcapture(hal_timer_dev_struct *timer_dev, uint32_t channel);
/* stop TIMER input capture mode */
int32_t hal_timer_stop_inputcapture(hal_timer_dev_struct *timer_dev, uint32_t channel);
/* start TIMER input capture mode and channel interrupt */
int32_t hal_timer_start_inputcapture_interrupt(hal_timer_dev_struct *timer_dev, uint32_t channel);
/* stop TIMER input capture mode and channel interrupt */
int32_t hal_timer_stop_inputcapture_interrupt(hal_timer_dev_struct *timer_dev, uint32_t channel);
/* start TIMER channel input capture and channel dma request */
int32_t hal_timer_start_inputcapture_dma(hal_timer_dev_struct *timer_dev, uint32_t channel, uint32_t *buffer, uint16_t blength);
/* stop TIMER channel input capture and channel dma request */
int32_t hal_timer_stop_inputcapture_dma(hal_timer_dev_struct *timer_dev, uint32_t channel);
/* read TIMER channel capture compare register value */
uint32_t hal_timer_read_capture_value(hal_timer_dev_struct *timer_dev, uint16_t channel);

/* single pulse mode */
/* initialize TIMER single pulse mode */
int32_t hal_timer_singlepulse_mode_init(hal_timer_dev_struct *timer_dev, uint32_t timer_singlepulse);
/* TIMER single pulse mode configure */
int32_t hal_timer_singlepulse_channel_config(hal_timer_dev_struct *timer_dev,hal_timer_singlepulse_struct *singlepulse,uint32_t channel_out,uint32_t channel_in);
/* start TIMER single pulse mode */
int32_t hal_timer_start_singlepulse(hal_timer_dev_struct *timer_dev, uint32_t out_channel);
/* stop TIMER single pulse mode */
int32_t hal_timer_stop_singlepulse(hal_timer_dev_struct *timer_dev, uint32_t out_channel);
/* start TIMER single pulse mode and channel interrupt */
int32_t hal_timer_start_singlepulse_interrupt(hal_timer_dev_struct *timer_dev, uint32_t out_channel);
/* stop TIMER single pulse mode and channel interrupt */
int32_t hal_timer_stop_singlepulse_interrupt(hal_timer_dev_struct *timer_dev, uint32_t out_channel);
/* start TIMER complementay channel single pulse mode */
int32_t hal_timer_start_negtive_singlepulse(hal_timer_dev_struct *timer_dev, uint16_t out_channel);
/* stop TIMER complementay channel single pulse mode */
int32_t hal_timer_stop_negtive_singlepulse(hal_timer_dev_struct *timer_dev, uint16_t out_channel);
/* start TIMER complementay channel single pulse mode and channel interrupt */
int32_t hal_timer_start_negtive_singlepulse_interrupt(hal_timer_dev_struct *timer_dev, uint16_t out_channel);
/* stop TIMER complementay channel single pulse mode and channel interrupt */
int32_t hal_timer_stop_negtive_singlepulse_interrupt(hal_timer_dev_struct *timer_dev, uint16_t out_channel);

/* quadrature decoder mode settings */
/* initialize TIMER quadrature decoder  mode */
int32_t hal_timer_quadrature_decoder_init(hal_timer_dev_struct *timer_dev, hal_timer_quadrature_decoder_struct *decode);
/* start TIMER decode mode */
int32_t hal_timer_start_quadrature_decoder(hal_timer_dev_struct *timer_dev, uint32_t channel);
/* stop TIMER decode mode */
int32_t hal_timer_stop_quadrature_decoder(hal_timer_dev_struct *timer_dev, uint32_t channel);
/* start TIMER decode mode and channel interrupt */
int32_t hal_timer_start_quadrature_decoder_interrupt(hal_timer_dev_struct *timer_dev, uint32_t channel);
/* stop TIMER decode mode and channel interrupt */
int32_t hal_timer_stop_quadrature_decoder_interrupt(hal_timer_dev_struct *timer_dev, uint32_t channel);
/* start TIMER decode mode and channel dma request */
int32_t hal_timer_start_quadrature_decoder_dma(hal_timer_dev_struct *timer_dev, uint32_t channel, uint32_t *buffer0, uint32_t *buffer1, uint16_t blength);
/* stop TIMER decode mode and channel dma request */
int32_t hal_timer_stop_quadrature_decoder_dma(hal_timer_dev_struct *timer_dev, uint32_t channel);

/* DMA mode settings*/
/* start TIMER DMA mode for writing data to TIMER */
int32_t hal_timer_start_dmatransfer_write(hal_timer_dev_struct *timer_dev, hal_timer_dma_start_address_enum dma_startaddr, uint32_t dma_count,\
                            hal_timer_dma_request_source_enum dma_reqsrc, uint32_t *srcbuffer);
/* stop TIMER DMA mode for writing data to TIMER */
int32_t hal_timer_stop_dmatransfer_write(hal_timer_dev_struct *timer_dev, hal_timer_dma_request_source_enum dma_reqsrc);
/* start TIMER DMA mode for read data from TIMER */
int32_t hal_timer_start_dmatransfer_read(hal_timer_dev_struct *timer_dev, hal_timer_dma_start_address_enum dma_startaddr, uint32_t dma_count,\
                            hal_timer_dma_request_source_enum dma_reqsrc, uint32_t *srcbuffer);
/* stop TIMER DMA mode for read data from TIMER */
int32_t hal_timer_stop_dmatransfer_read(hal_timer_dev_struct *timer_dev, hal_timer_dma_request_source_enum dma_reqsrc);

