SIGS618/GD32IDE-Project---Learn/firmware/GD32E23x_hal_peripheral/Include/gd32e23x_hal_timer.h
/* HALL sensor interface settings */
/* initialize TIMER HALL mode */
int32_t hal_timer_hall_init(hal_timer_dev_struct *timer_dev,hal_timer_hall_struct *hall_init);
/* start TIMER HALL mode */
int32_t hal_timer_start_hall(hal_timer_dev_struct *timer_dev);
/* stop TIMER HALL mode */
int32_t hal_timer_stop_hall(hal_timer_dev_struct *timer_dev);
/* start TIMER HALL mode and channel interrupt */
int32_t hal_timer_start_hall_interrupt(hal_timer_dev_struct *timer_dev);
/* stop TIMER HALL mode and channel interrupt */
int32_t hal_timer_stop_hall_interrupt(hal_timer_dev_struct *timer_dev);
/* start TIMER HALL mode and channel dma request */
int32_t hal_timer_start_hall_dma(hal_timer_dev_struct *timer_dev, uint32_t *buffer, uint16_t blength);
/* stop TIMER HALL mode and channel dma request */
int32_t hal_timer_stop_hall_dma(hal_timer_dev_struct *timer_dev);

/* commutation control settings */
/* config TIMER commutation_event */
int32_t hal_timer_commutation_event_config(hal_timer_dev_struct *timer_dev,uint32_t trigger_source, uint32_t com_source);
/* config TIMER commutation_event and enable CMT interrupt */
int32_t hal_timer_commutation_event_interrupt_config(hal_timer_dev_struct *timer_dev,uint32_t trigger_source, uint32_t com_source);
/* config TIMER commutation_event and enable CMT DMA request */
int32_t hal_timer_commutation_event_dma_config(hal_timer_dev_struct *timer_dev,uint32_t trigger_source, uint32_t com_source);

/* set user-defined interrupt callback function, 
which will be registered and called when corresponding interrupt be triggered */
int32_t hal_timer_irq_handle_set(hal_timer_dev_struct *timer_dev, hal_timer_irq_struct *user_func);
/* reset all user-defined interrupt callback function */
int32_t hal_timer_irq_handle_all_reset(hal_timer_dev_struct *timer_dev);
/* interupt handle*/
void hal_timer_irq(hal_timer_dev_struct *timer_dev);

/* commonly used register settings */
/* write the current counter value, TIMERx_CNT */
int32_t hal_timer_write_counter_value(hal_timer_dev_struct *timer_dev, uint32_t counter_value);
/* read the current counter value, TIMERx_CNT */
uint32_t hal_timer_read_counter_value(hal_timer_dev_struct *timer_dev);
/* write counter auto reload value, TIMERx_CAR */
int32_t hal_timer_write_autoreload_value(hal_timer_dev_struct *timer_dev, uint32_t autoreload);
/* read counter auto reload value, TIMERx_CAR */
uint32_t hal_timer_read_autoreload_value(hal_timer_dev_struct *timer_dev);
/* write counter repetition value, TIMERx_CREP */
int32_t hal_timer_write_repetition_value(hal_timer_dev_struct *timer_dev, uint32_t repetition_value);
/* read counter repetition value, TIMERx_CREP */
uint32_t hal_timer_read_repetition_value(hal_timer_dev_struct *timer_dev);
/* write prescaler value of the counter clock, TIMERx_PSC */
int32_t hal_timer_write_prescaler_value(hal_timer_dev_struct *timer_dev, uint32_t prescaler);
/* read prescaler value of the counter clock, TIMERx_PSC */
uint32_t hal_timer_read_prescaler_value(hal_timer_dev_struct *timer_dev);
/* write channely capture/compare value, TIMERx_CHyCV */
int32_t hal_timer_write_channelx_value(hal_timer_dev_struct *timer_dev, uint32_t channel, uint32_t value);
/* read channely capture/compare value, TIMERx_CHyCV */
uint32_t hal_timer_read_channelx_value(hal_timer_dev_struct *timer_dev, uint32_t channel);

#endif /* GD32E23X_HAL_TIMER_H */
